import React from "react";
import WorkStages from "./WorkStages";

// Дані для кроків
const steps = [
  {
    number: "1",
    title: "Підготовка",
    points: [
      "Консультація та аналіз потреб клієнта",
      "Формування тз",
      "брейешторм з клієнтом",
      "Підготовка прототипів та погодження структури.",
    ],
  },
  {
    number: "2",
    title: "Розробка",
    points: [
      "Розробка кабінету користувача та адміністративної панелі. Інтеграція зі сторонніми сервісами. ",
      "Мобільна адаптація та оптимізація продуктивності ",
    ],
  },
  {
    number: "3",
    title: "Запуск",
    points: [
      "Навчання по користуванню.",
      "Деплой сайту на домен та хостинг.",
      "Місяць безкоштовного тех. обслуговування.",
    ],
  },
];

// Компонент, що передає дані в WorkStages
const Card: React.FC = () => {
  return <WorkStages steps={steps} />;
};

export default Card;
